phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
/*
 * Phoenix-RTOS
 *
 * Operating system kernel
 *
 * iMXRT basic peripherals control functions
 *
 * Copyright 2017, 2019 Phoenix Systems
 * Author: Aleksander Kaminski, Jan Sikorski
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "hal/cpu.h"
#include "hal/hal.h"
#include "hal/spinlock.h"
#include "hal/armv7m/imxrt/halsyspage.h"

#include "include/errno.h"
#include "include/arch/armv7m/imxrt/10xx/imxrt10xx.h"

#include "hal/arm/scs.h"
#include "hal/arm/rtt.h"

#include "imxrt10xx.h"
#include "config.h"

#include <board_config.h>


#define RTWDOG_UPDATE_KEY  0xd928c520U
#define RTWDOG_REFRESH_KEY 0xb480a602U
#define LPO_CLK_FREQ_HZ    32000U

#if defined(WATCHDOG)
#if !defined(WATCHDOG_TIMEOUT_MS)
#error "WATCHDOG_TIMEOUT_MS not defined"
#elif (WATCHDOG_TIMEOUT_MS <= 0x0 || WATCHDOG_TIMEOUT_MS > (0xffffU * 256 / (LPO_CLK_FREQ_HZ / 1000)))
#error "Watchdog timeout out of bounds!"
#endif
#endif

static struct {
	volatile u32 *gpio[5];
	volatile u32 *aips[4];
	volatile u32 *ccm;
	volatile u32 *ccm_analog;
	volatile u32 *pmu;
	volatile u32 *xtalosc;
	volatile u32 *iomuxc;
	volatile u32 *iomuxgpr;
	volatile u32 *iomuxsnvs;
	volatile u32 *stk;
	volatile u16 *wdog1;
	volatile u16 *wdog2;
	volatile u32 *rtwdog;
	volatile u32 *src;

	u32 xtaloscFreq;
	u32 cpuclk;

	spinlock_t pltctlSp;
} imxrt_common;


/* clang-format off */
enum { gpio_dr = 0, gpio_gdir, gpio_psr, gpio_icr1, gpio_icr2, gpio_imr, gpio_isr, gpio_edge_sel };


enum { aipstz_mpr = 0, aipstz_opacr = 16, aipstz_opacr1, aipstz_opacr2, aipstz_opacr3, aipstz_opacr4 };


enum { ccm_ccr = 0, /* reserved */ ccm_csr = 2, ccm_ccsr, ccm_cacrr, ccm_cbcdr, ccm_cbcmr, ccm_cscmr1, ccm_cscmr2,
	ccm_cscdr1, ccm_cs1cdr, ccm_cs2cdr, ccm_cdcdr, /* reserved */ ccm_cscdr2 = 14, ccm_cscdr3, /* 2 reserved */
	ccm_cdhipr = 18, /* 2 reserved */ ccm_clpcr = 21, ccm_cisr, ccm_cimr, ccm_ccosr, ccm_cgpr, ccm_ccgr0, ccm_ccgr1,
	ccm_ccgr2, ccm_ccgr3, ccm_ccgr4, ccm_ccgr5, ccm_ccgr6, ccm_ccgr7, ccm_cmeor };


enum { ccm_analog_pll_arm, ccm_analog_pll_arm_set, ccm_analog_pll_arm_clr, ccm_analog_pll_arm_tog,
	ccm_analog_pll_usb1, ccm_analog_pll_usb1_set, ccm_analog_pll_usb1_clr, ccm_analog_pll_usb1_tog,
	ccm_analog_pll_usb2, ccm_analog_pll_usb2_set, ccm_analog_pll_usb2_clr, ccm_analog_pll_usb2_tog,
	ccm_analog_pll_sys, ccm_analog_pll_sys_set, ccm_analog_pll_sys_clr, ccm_analog_pll_sys_tog,
	ccm_analog_pll_sys_ss, /* 3 reserved */ ccm_analog_pll_sys_num = 20, /* 3 reserved */
	ccm_analog_pll_sys_denom = 24, /* 3 reserved */ ccm_analog_pll_audio = 28, ccm_analog_pll_audio_set,
	ccm_analog_pll_audio_clr, ccm_analog_pll_audio_tog, ccm_analog_pll_audio_num, /* 3 reserved */
	ccm_analog_pll_audio_denom = 36, /* 3 reserved */ ccm_analog_pll_video = 40, ccm_analog_pll_video_set,
	ccm_analog_pll_video_clr, ccm_analog_pll_video_tog, ccm_analog_pll_video_num, /* 3 reserved */
	ccm_analog_pll_video_denom = 48, /* 3 reserved */ ccm_analog_pll_enet = 56, ccm_analog_pll_enet_set,
	ccm_analog_pll_enet_clr, ccm_analog_pll_enet_tog, ccm_analog_pfd_480, ccm_analog_pfd_480_set,
	ccm_analog_pfd_480_clr, ccm_analog_pfd_480_tog, ccm_analog_pfd_528, ccm_analog_pfd_528_set,
	ccm_analog_pfd_528_clr, ccm_analog_pfd_528_tog, ccm_analog_misc0 = 84, ccm_analog_misc0_set,
	ccm_analog_misc0_clr, ccm_analog_misc0_tog, ccm_analog_misc1, ccm_analog_misc1_set, ccm_analog_misc1_clr,
	ccm_analog_misc1_tog, ccm_analog_misc2, ccm_analog_misc2_set, ccm_analog_misc2_clr, ccm_analog_misc2_tog };


enum { pmu_reg_1p1 = 0, /* 3 reserved */ pmu_reg_3p0 = 4, /* 3 reserved */ pmu_reg_2p5 = 8, /* 3 reserved */
	pmu_reg_core = 12, /* 3 reserved */ pmu_misc0 = 16, /* 3 reserved */ pmu_misc1 = 20, pmu_misc1_set,
	pmu_misc1_clr, pmu_misc1_tog, pmu_misc2, pmu_misc2_set, pmu_misc2_clr, pmu_misc2_tog };


enum { xtalosc_misc0 = 84, xtalosc_lowpwr_ctrl = 156, xtalosc_lowpwr_ctrl_set, xtalosc_lowpwr_ctrl_clr,
	xtalosc_lowpwr_ctrl_tog, xtalosc_osc_config0 = 168, xtalosc_osc_config0_set, xtalosc_osc_config0_clr,
	xtalosc_osc_config0_tog, xtalosc_osc_config1, xtalosc_osc_config1_set, xtalosc_osc_config1_clr,
	xtalosc_osc_config1_tog, xtalosc_osc_config2, xtalosc_osc_config2_set, xtalosc_osc_config2_clr, xtalosc_osc_config2_tog };


enum { osc_rc = 0, osc_xtal };


enum { stk_ctrl = 0, stk_load, stk_val, stk_calib };


enum { src_scr = 0, src_sbmr1, src_srsr, src_sbmr2 = 7, src_gpr1, src_gpr2, src_gpr3, src_gpr4,
	src_gpr5, src_gpr6, src_gpr7, src_gpr8, src_gpr9, src_gpr10 };


enum { wdog_wcr = 0, wdog_wsr, wdog_wrsr, wdog_wicr, wdog_wmcr };


enum { rtwdog_cs = 0, rtwdog_cnt, rtwdog_toval, rtwdog_win };
/* clang-format on */


/* platformctl syscall */


static int _imxrt_isValidDev(int dev)
{
	if ((dev < pctl_clk_aips_tz1) || (dev > pctl_clk_flexio3)) {
		return 0;
	}

	return 1;
}


static int _imxrt_getDevClock(int dev, unsigned int *state)
{
	int ccgr;
	unsigned int flag;

	if (_imxrt_isValidDev(dev) == 0) {
		return -EINVAL;
	}

	ccgr = dev / 16;
	flag = 3UL << (2U * ((unsigned int)dev % 16U));

	*state = (*(imxrt_common.ccm + ccm_ccgr0 + ccgr) & flag) >> (2U * ((unsigned int)dev % 16U));

	return EOK;
}


static int _imxrt_setDevClock(int dev, unsigned int state)
{
	int ccgr;
	unsigned int flag, mask;
	u32 t;

	if (_imxrt_isValidDev(dev) == 0) {
		return -EINVAL;
	}

	ccgr = dev / 16;
	flag = (state & 3U) << (2U * ((unsigned int)dev % 16U));
	mask = 3UL << (2U * ((unsigned int)dev % 16U));

	t = *(imxrt_common.ccm + ccm_ccgr0 + ccgr) & ~mask;
	*(imxrt_common.ccm + ccm_ccgr0 + ccgr) = t | flag;

	return EOK;
}


static int _imxrt_checkIOgprArg(int field, unsigned int *mask)
{
	if ((field < pctl_gpr_sai1_mclk1_sel) || (field > pctl_gpr_sip_test_mux_qspi_sip_en)) {
		return -EINVAL;
	}

	switch (field) {
		case pctl_gpr_sai1_mclk3_sel:
		case pctl_gpr_sai2_mclk3_sel:
		case pctl_gpr_sai3_mclk3_sel:
		case pctl_gpr_m7_apc_ac_r0_ctrl:
		case pctl_gpr_m7_apc_ac_r1_ctrl:
		case pctl_gpr_m7_apc_ac_r2_ctrl:
		case pctl_gpr_m7_apc_ac_r3_ctrl:
			(*mask) = 0x3;
			break;

		case pctl_gpr_sai1_mclk1_sel:
		case pctl_gpr_sai1_mclk2_sel:
			(*mask) = 0x7;
			break;

		case pctl_gpr_ocram_ctl:
		case pctl_gpr_ocram2_ctl:
		case pctl_gpr_ocram_status:
		case pctl_gpr_ocram2_status:
		case pctl_gpr_bee_de_rx_en:
		case pctl_gpr_cm7_cfgitcmsz:
		case pctl_gpr_cm7_cfgdtcmsz:
			(*mask) = 0xf;
			break;

		case pctl_gpr_ocram_tz_addr:
		case pctl_gpr_lock_ocram_tz_addr:
		case pctl_gpr_ocram2_tz_addr:
		case pctl_gpr_lock_ocram2_tz_addr:
			(*mask) = 0x7f;
			break;

		case pctl_gpr_mqs_clk_div:
		case pctl_gpr_sip_test_mux_qspi_sip_sel:
			(*mask) = 0xff;
			break;

		case pctl_gpr_flexspi_remap_addr_start:
		case pctl_gpr_flexspi_remap_addr_end:
		case pctl_gpr_flexspi_remap_addr_offset:
			(*mask) = 0xfffff;
			break;

		case pctl_gpr_m7_apc_ac_r0_bot:
		case pctl_gpr_m7_apc_ac_r0_top:
		case pctl_gpr_m7_apc_ac_r1_bot:
		case pctl_gpr_m7_apc_ac_r1_top:
		case pctl_gpr_m7_apc_ac_r2_bot:
		case pctl_gpr_m7_apc_ac_r2_top:
		case pctl_gpr_m7_apc_ac_r3_bot:
		case pctl_gpr_m7_apc_ac_r3_top:
			(*mask) = 0x1fffffff;
			break;

		case pctl_gpr_flexram_bank_cfg:
		case pctl_gpr_gpio_mux1_gpio_sel:
		case pctl_gpr_gpio_mux2_gpio_sel:
		case pctl_gpr_gpio_mux3_gpio_sel:
		case pctl_gpr_gpio_mux4_gpio_sel:
			(*mask) = 0xffffffffUL;
			break;

		default:
			(*mask) = 1;
			break;
	}

	return EOK;
}


static int _imxrt_setIOgpr(int field, unsigned int val)
{
	unsigned int mask, t;
	int err;

