phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
	err = _imxrt_checkIOgprArg(field, &mask);
	if (err != EOK) {
		return err;
	}

	t = *(imxrt_common.iomuxgpr + ((unsigned int)field >> 5)) & ~(mask << ((unsigned int)field & 0x1fU));
	*(imxrt_common.iomuxgpr + ((unsigned int)field >> 5)) = t | (val & mask) << ((unsigned int)field & 0x1fU);

	return EOK;
}


static int _imxrt_getIOgpr(int field, unsigned int *val)
{
	unsigned int mask;
	int err;

	err = _imxrt_checkIOgprArg(field, &mask);
	if (err != EOK) {
		return err;
	}

	*val = (*(imxrt_common.iomuxgpr + ((unsigned int)field >> 5)) >> ((unsigned int)field & 0x1fU)) & mask;

	return EOK;
}


static volatile u32 *_imxrt_IOmuxGetReg(int mux)
{
	if ((mux < pctl_mux_gpio_emc_00) || (mux > pctl_mux_snvs_pmic_stby_req)) {
		return NULL;
	}

	if (mux >= pctl_mux_snvs_wakeup) {
		return imxrt_common.iomuxsnvs + (mux - pctl_mux_snvs_wakeup);
	}

	return imxrt_common.iomuxc + mux + 5;
}


int _imxrt_setIOmux(int mux, int sion, int mode)
{
	volatile u32 *reg;

	reg = _imxrt_IOmuxGetReg(mux);
	if (reg == NULL) {
		return -EINVAL;
	}

	(*reg) = ((sion == 0 ? 0UL : 1UL) << 4) | ((unsigned int)mode & 0xfU);

	return EOK;
}


static int _imxrt_getIOmux(int mux, int *sion, int *mode)
{
	u32 t;
	volatile u32 *reg;

	reg = _imxrt_IOmuxGetReg(mux);
	if (reg == NULL) {
		return -EINVAL;
	}

	t = (*reg);
	*sion = (t & (1U << 4)) == 0U ? 0 : 1;
	*mode = (int)(u32)(t & 0xfU);

	return EOK;
}


static volatile u32 *_imxrt_IOpadGetReg(int pad)
{
	if ((pad < pctl_pad_gpio_emc_00) || (pad > pctl_pad_snvs_pmic_stby_req)) {
		return NULL;
	}

	if (pad >= pctl_pad_snvs_test_mode) {
		return imxrt_common.iomuxsnvs + 3 + (pad - pctl_pad_snvs_test_mode);
	}

	if (pad >= pctl_pad_gpio_spi_b0_00) {
		return imxrt_common.iomuxc + 429 + (pad - pctl_pad_gpio_spi_b0_00);
	}

	return imxrt_common.iomuxc + 129 + pad;
}


int _imxrt_setIOpad(int pad, u8 hys, u8 pus, u8 pue, u8 pke, u8 ode, u8 speed, u8 dse, u8 sre)
{
	u32 t;
	volatile u32 *reg;

	reg = _imxrt_IOpadGetReg(pad);
	if (reg == NULL) {
		return -EINVAL;
	}

	t = ((hys == 0U ? 0UL : 1UL) << 16) | (((u32)pus & 0x3U) << 14) | ((pue == 0U ? 0UL : 1UL) << 13) | ((pke == 0U ? 0UL : 1UL) << 12);
	t |= ((ode == 0U ? 0UL : 1UL) << 11) | (((u32)speed & 0x3U) << 6) | (((u32)dse & 0x7U) << 3) | (sre == 0U ? 0UL : 1UL);
	(*reg) = t;

	return EOK;
}


static int _imxrt_getIOpad(int pad, u8 *hys, u8 *pus, u8 *pue, u8 *pke, u8 *ode, u8 *speed, u8 *dse, u8 *sre)
{
	u32 t;
	volatile u32 *reg;

	reg = _imxrt_IOpadGetReg(pad);
	if (reg == NULL) {
		return -EINVAL;
	}

	t = (*reg);

	*hys = (u8)((t >> 16) & 0x1U);
	*pus = (u8)((t >> 14) & 0x3U);
	*pue = (u8)((t >> 13) & 0x1U);
	*pke = (u8)((t >> 12) & 0x1U);
	*ode = (u8)((t >> 11) & 0x1U);
	*speed = (u8)((t >> 6) & 0x3U);
	*dse = (u8)((t >> 3) & 0x7U);
	*sre = (u8)(t & 0x1U);

	return EOK;
}


static volatile u32 *_imxrt_IOiselGetReg(int isel, u32 *mask)
{
	if ((isel < pctl_isel_anatop_usb_otg1_id) || (isel > pctl_isel_canfd_ipp_ind_canrx)) {
		return NULL;
	}

	switch (isel) {
		case pctl_isel_ccm_pmic_ready:
		case pctl_isel_csi_hsync:
		case pctl_isel_csi_vsync:
		case pctl_isel_enet_mdio:
		case pctl_isel_enet0_timer:
		case pctl_isel_flexcan1_rx:
		case pctl_isel_flexcan2_rx:
		case pctl_isel_flexpwm1_pwma3:
		case pctl_isel_flexpwm1_pwmb3:
		case pctl_isel_flexpwm2_pwma3:
		case pctl_isel_flexpwm2_pwmb3:
		case pctl_isel_lpi2c3_scl:
		case pctl_isel_lpi2c3_sda:
		case pctl_isel_lpuart3_rx:
		case pctl_isel_lpuart3_tx:
		case pctl_isel_lpuart4_rx:
		case pctl_isel_lpuart4_tx:
		case pctl_isel_lpuart8_rx:
		case pctl_isel_lpuart8_tx:
		case pctl_isel_qtimer3_timer0:
		case pctl_isel_qtimer3_timer1:
		case pctl_isel_qtimer3_timer2:
		case pctl_isel_qtimer3_timer3:
		case pctl_isel_sai1_mclk2:
		case pctl_isel_sai1_rx_bclk:
		case pctl_isel_sai1_rx_data0:
		case pctl_isel_sai1_rx_sync:
		case pctl_isel_sai1_tx_bclk:
		case pctl_isel_sai1_tx_sync:
		case pctl_isel_usdhc1_cd_b:
		case pctl_isel_usdhc1_wp:
		case pctl_isel_xbar1_in17:
		case pctl_isel_enet2_ipg_clk_rmii:
		case pctl_isel_enet2_ipp_ind_mac0_rxdata:
		case pctl_isel_enet2_ipp_ind_mac0_rxen:
		case pctl_isel_enet2_ipp_ind_mac0_rxerr:
		case pctl_isel_enet2_ipp_ind_mac0_txclk:
		case pctl_isel_semc_i_ipp_ind_dqs4:
		case pctl_isel_canfd_ipp_ind_canrx:
			(*mask) = 0x3;
			break;

		default:
			(*mask) = 0x1;
			break;
	}

	if (isel >= pctl_isel_enet2_ipg_clk_rmii) {
		return imxrt_common.iomuxc + 451 + (isel - pctl_isel_enet2_ipg_clk_rmii);
	}

	return imxrt_common.iomuxc + 253 + isel;
}


int _imxrt_setIOisel(int isel, int daisy)
{
	volatile u32 *reg;
	u32 mask;

	reg = _imxrt_IOiselGetReg(isel, &mask);
	if (reg == NULL) {
		return -EINVAL;
	}

	(*reg) = (u32)daisy & mask;

	return EOK;
}


static int _imxrt_getIOisel(int isel, int *daisy)
{
	volatile u32 *reg;
	u32 mask;

	reg = _imxrt_IOiselGetReg(isel, &mask);
	if (reg == NULL) {
		return -EINVAL;
	}

	*daisy = (int)(u32)((*reg) & mask);

	return EOK;
}


int hal_platformctl(void *ptr)
{
	platformctl_t *data = ptr;
	int ret = -EINVAL;
	unsigned int state = 0;
	spinlock_ctx_t sc;
	int sion = 0, mode = 0, daisy = 0;

	hal_spinlockSet(&imxrt_common.pltctlSp, &sc);

	switch (data->type) {
		case pctl_devclock:
			if (data->action == pctl_set) {
				ret = _imxrt_setDevClock(data->devclock.dev, data->devclock.state);
			}
			else if (data->action == pctl_get) {
				ret = _imxrt_getDevClock(data->devclock.dev, &state);
				data->devclock.state = state;
			}
			else {
				/* No action required */
			}
			break;

		case pctl_iogpr:
			if (data->action == pctl_set) {
				ret = _imxrt_setIOgpr(data->iogpr.field, data->iogpr.val);
			}
			else if (data->action == pctl_get) {
				ret = _imxrt_getIOgpr(data->iogpr.field, &state);
				data->iogpr.val = state;
			}
			else {
				/* No action required */
			}
			break;

		case pctl_iomux:
			if (data->action == pctl_set) {
				ret = _imxrt_setIOmux(data->iomux.mux, data->iomux.sion, data->iomux.mode);
			}
			else if (data->action == pctl_get) {

				ret = _imxrt_getIOmux(data->iomux.mux, &sion, &mode);
				data->iomux.sion = sion;
				data->iomux.mode = mode;
			}
			else {
				/* No action required */
			}
			break;

		case pctl_iopad:
			if (data->action == pctl_set) {
				ret = _imxrt_setIOpad(data->iopad.pad, data->iopad.hys, data->iopad.pus, data->iopad.pue,
						data->iopad.pke, data->iopad.ode, data->iopad.speed, data->iopad.dse, data->iopad.sre);
			}
			else if (data->action == pctl_get) {
				ret = _imxrt_getIOpad(data->iopad.pad, &data->iopad.hys, &data->iopad.pus, &data->iopad.pue,
						&data->iopad.pke, &data->iopad.ode, &data->iopad.speed, &data->iopad.dse, &data->iopad.sre);
			}
			else {
				/* No action required */
			}
			break;

		case pctl_ioisel:
			if (data->action == pctl_set) {
				ret = _imxrt_setIOisel(data->ioisel.isel, data->ioisel.daisy);
			}
			else if (data->action == pctl_get) {
				ret = _imxrt_getIOisel(data->ioisel.isel, &daisy);
				data->ioisel.daisy = daisy;
			}
			else {
				/* No action required */
			}
			break;

		case pctl_reboot:
			if (data->action == pctl_set) {
				if (data->reboot.magic == PCTL_REBOOT_MAGIC) {
					_hal_scsSystemReset();
				}
			}
			else if (data->action == pctl_get) {
				data->reboot.reason = syspage->hs.bootReason;
				ret = EOK;
			}
			else {
				/* No action required */
			}
			break;

		case pctl_devcache:
			if (data->action == pctl_set) {
				if (data->devcache.state == 0U) {
					_hal_scsDCacheDisable();
					_hal_scsICacheDisable();
				}
				else {
					_hal_scsDCacheEnable();
					_hal_scsICacheEnable();
				}

				ret = EOK;
			}
			break;

		case pctl_cleanInvalDCache:
			if (data->action == pctl_set) {
				_hal_scsDCacheCleanInvalAddr(data->cleanInvalDCache.addr, data->cleanInvalDCache.sz);
				ret = EOK;
			}
			break;

		default:
			/* No action required */
			break;
	}

	hal_spinlockClear(&imxrt_common.pltctlSp, &sc);

	return ret;
}


/* CCM (Clock Controller Module) */


