phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
static u32 _imxrt_ccmGetPeriphClkFreq(void)
{
	u32 freq;

	/* Periph_clk2_clk ---> Periph_clk */
	if ((*(imxrt_common.ccm + ccm_cbcdr) & (1UL << 25)) != 0U) {
		switch ((*(imxrt_common.ccm + ccm_cbcmr) >> 12) & 0x3U) {
			/* Pll3_sw_clk ---> Periph_clk2_clk ---> Periph_clk */
			case 0x0:
				freq = _imxrt_ccmGetPllFreq(clk_pll_usb1);
				break;

			/* Osc_clk ---> Periph_clk2_clk ---> Periph_clk */
			case 0x1:
				freq = imxrt_common.xtaloscFreq;
				break;

			default:
				freq = 0;
				break;
		}

		freq /= ((*(imxrt_common.ccm + ccm_cbcdr) >> 27) & 0x7U) + 1U;
	}
	else { /* Pre_Periph_clk ---> Periph_clk */
		switch ((*(imxrt_common.ccm + ccm_cbcmr) >> 18) & 0x3U) {
			/* PLL2 ---> Pre_Periph_clk ---> Periph_clk */
			case 0x0:
				freq = _imxrt_ccmGetPllFreq(clk_pll_sys);
				break;

			/* PLL2 PFD2 ---> Pre_Periph_clk ---> Periph_clk */
			case 0x1:
				freq = _imxrt_ccmGetSysPfdFreq(clk_pfd2);
				break;

			/* PLL2 PFD0 ---> Pre_Periph_clk ---> Periph_clk */
			case 0x2:
				freq = _imxrt_ccmGetSysPfdFreq(clk_pfd0);
				break;

			/* PLL1 divided(/2) ---> Pre_Periph_clk ---> Periph_clk */
			case 0x3:
				freq = _imxrt_ccmGetPllFreq(clk_pll_arm) / ((*(imxrt_common.ccm + ccm_cacrr) & 0x7U) + 1U);
				break;

			default:
				freq = 0;
				break;
		}
	}

	return freq;
}


void _imxrt_ccmInitExterlnalClk(void)
{
	/* Power up */
	*(imxrt_common.ccm_analog + ccm_analog_misc0_clr) = 1UL << 30;
	while ((*(imxrt_common.xtalosc + xtalosc_lowpwr_ctrl) & (1UL << 16)) == 0U) {
	}

	/* Detect frequency */
	*(imxrt_common.ccm_analog + ccm_analog_misc0_set) = 1UL << 16;
	while ((*(imxrt_common.ccm_analog + ccm_analog_misc0) & (1UL << 15)) == 0U) {
	}

	*(imxrt_common.ccm_analog + ccm_analog_misc0_clr) = 1UL << 16;
}


void _imxrt_ccmDeinitExternalClk(void)
{
	/* Power down */
	*(imxrt_common.ccm_analog + ccm_analog_misc0_set) = 1UL << 30;
}


void _imxrt_ccmSwitchOsc(int osc)
{
	if (osc == osc_rc) {
		*(imxrt_common.xtalosc + xtalosc_lowpwr_ctrl_set) = 1UL << 4;
	}
	else {
		*(imxrt_common.xtalosc + xtalosc_lowpwr_ctrl_clr) = 1UL << 4;
	}
}


void _imxrt_ccmInitRcOsc24M(void)
{
	*(imxrt_common.xtalosc + xtalosc_lowpwr_ctrl_set) = 1;
}


void _imxrt_ccmDeinitRcOsc24M(void)
{
	*(imxrt_common.xtalosc + xtalosc_lowpwr_ctrl_clr) = 1;
}


u32 _imxrt_ccmGetFreq(int name)
{
	u32 freq;

	switch (name) {
		/* Periph_clk ---> AHB Clock */
		case clk_cpu:
		case clk_ahb:
			freq = _imxrt_ccmGetPeriphClkFreq() / (((u32)((*(imxrt_common.ccm + ccm_cbcdr) > 10U) ? 1U : 0U) & 0x7U) + 1U);
			break;

		case clk_semc:
			/* SEMC alternative clock ---> SEMC Clock */
			if ((*(imxrt_common.ccm + ccm_cbcdr) & (1U << 6)) != 0U) {
				/* PLL3 PFD1 ---> SEMC alternative clock ---> SEMC Clock */
				if ((*(imxrt_common.ccm + ccm_cbcdr) & 0x7U) != 0U) {
					freq = _imxrt_ccmGetUsb1PfdFreq(clk_pfd1);
				}
				/* PLL2 PFD2 ---> SEMC alternative clock ---> SEMC Clock */
				else {
					freq = _imxrt_ccmGetSysPfdFreq(clk_pfd2);
				}
			}
			/* Periph_clk ---> SEMC Clock */
			else {
				freq = _imxrt_ccmGetPeriphClkFreq();
			}

			freq /= ((*(imxrt_common.ccm + ccm_cbcdr) >> 16) & 0x7U) + 1U;
			break;

		case clk_ipg:
			/* Periph_clk ---> AHB Clock ---> IPG Clock */
			freq = _imxrt_ccmGetPeriphClkFreq() / (((*(imxrt_common.ccm + ccm_cbcdr) >> 10) & 0x7U) + 1U);
			freq /= ((*(imxrt_common.ccm + ccm_cbcdr) >> 8) & 0x3U) + 1U;
			break;

		case clk_osc:
			freq = _imxrt_ccmGetOscFreq();
			break;
		case clk_rtc:
			freq = 32768;
			break;
		case clk_armpll:
			freq = _imxrt_ccmGetPllFreq(clk_pll_arm);
			break;
		case clk_usb1pll:
			freq = _imxrt_ccmGetPllFreq(clk_pll_usb1);
			break;
		case clk_usb1pfd0:
			freq = _imxrt_ccmGetUsb1PfdFreq(clk_pfd0);
			break;
		case clk_usb1pfd1:
			freq = _imxrt_ccmGetUsb1PfdFreq(clk_pfd1);
			break;
		case clk_usb1pfd2:
			freq = _imxrt_ccmGetUsb1PfdFreq(clk_pfd2);
			break;
		case clk_usb1pfd3:
			freq = _imxrt_ccmGetUsb1PfdFreq(clk_pfd3);
			break;
		case clk_usb2pll:
			freq = _imxrt_ccmGetPllFreq(clk_pll_usb2);
			break;
		case clk_syspll:
			freq = _imxrt_ccmGetPllFreq(clk_pll_sys);
			break;
		case clk_syspdf0:
			freq = _imxrt_ccmGetSysPfdFreq(clk_pfd0);
			break;
		case clk_syspdf1:
			freq = _imxrt_ccmGetSysPfdFreq(clk_pfd1);
			break;
		case clk_syspdf2:
			freq = _imxrt_ccmGetSysPfdFreq(clk_pfd2);
			break;
		case clk_syspdf3:
			freq = _imxrt_ccmGetSysPfdFreq(clk_pfd3);
			break;
		case clk_enetpll0:
			freq = _imxrt_ccmGetPllFreq(clk_pll_enet0);
			break;
		case clk_enetpll1:
			freq = _imxrt_ccmGetPllFreq(clk_pll_enet1);
			break;
		case clk_enetpll2:
			freq = _imxrt_ccmGetPllFreq(clk_pll_enet2);
			break;
		case clk_audiopll:
			freq = _imxrt_ccmGetPllFreq(clk_pll_audio);
			break;
		case clk_videopll:
			freq = _imxrt_ccmGetPllFreq(clk_pll_video);
			break;
		default:
			freq = 0U;
			break;
	}

	return freq;
}


u32 _imxrt_ccmGetOscFreq(void)
{
	return imxrt_common.xtaloscFreq;
}


void _imxrt_ccmSetOscFreq(u32 freq)
{
	imxrt_common.xtaloscFreq = freq;
}


void _imxrt_ccmInitArmPll(u32 div)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_arm) = (1UL << 13) | (div & 0x7fU);

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_arm) & (1UL << 31)) == 0U) {
	}
}


void _imxrt_ccmDeinitArmPll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_arm) = 1UL << 12;
}


void _imxrt_ccmInitSysPll(u8 div)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_sys) = (1UL << 13) | ((u32)div & 1U);

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_sys) & (1UL << 31)) == 0U) {
	}
}


void _imxrt_ccmDeinitSysPll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_sys) = 1UL << 12;
}


void _imxrt_ccmInitUsb1Pll(u8 div)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_usb1) = (1UL << 13) | (1UL << 12) | (1UL << 6) | ((u32)div & 0x3U);

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_usb1) & (1UL << 31)) == 0U) {
	}
}


void _imxrt_ccmDeinitUsb1Pll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_usb1) = 0;
}


void _imxrt_ccmInitUsb2Pll(u8 div)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_usb2) = (1UL << 13) | (1UL << 12) | (1UL << 6) | ((u32)div & 0x3U);

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_usb2) & (1UL << 31)) == 0U) {
	}
}


void _imxrt_ccmDeinitUsb2Pll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_usb2) = 0;
}


void _imxrt_ccmInitAudioPll(u8 loopdiv, u8 postdiv, u32 num, u32 denom)
{
	u32 pllAudio;

