phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
	*(imxrt_common.ccm_analog + ccm_analog_pll_audio_num) = num & 0x3fffffffU;
	*(imxrt_common.ccm_analog + ccm_analog_pll_audio_denom) = denom & 0x3fffffffU;

	pllAudio = (1UL << 13) | ((u32)loopdiv & 0x7fU);

	switch (postdiv) {
		case 16:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_set) = (1UL << 23) | (1UL << 15);
			break;

		case 8:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_set) = (1UL << 23) | (1UL << 15);
			pllAudio |= 1UL << 19;
			break;

		case 4:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_set) = (1UL << 23) | (1UL << 15);
			pllAudio |= 1UL << 20;
			break;

		case 2:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_clr) = (1UL << 23) | (1UL << 15);
			pllAudio |= 1UL << 19;
			break;

		default:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_clr) = (1UL << 23) | (1UL << 15);
			pllAudio |= 1UL << 20;
			break;
	}

	*(imxrt_common.ccm_analog + ccm_analog_pll_audio) = pllAudio;

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_audio) & (1UL << 31)) == 0U) {
	}
}


void _imxrt_ccmDeinitAudioPll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_audio) = 1UL << 12;
}


void _imxrt_ccmInitVideoPll(u8 loopdiv, u8 postdiv, u32 num, u32 denom)
{
	u32 pllVideo;

	*(imxrt_common.ccm_analog + ccm_analog_pll_video_num) = num & 0x3fffffffU;
	*(imxrt_common.ccm_analog + ccm_analog_pll_video_denom) = denom & 0x3fffffffU;

	pllVideo = (1UL << 13) | ((u32)loopdiv & 0x7fU);

	switch (postdiv) {
		case 16:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_set) = (3UL << 30);
			break;

		case 8:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_set) = (3UL << 30);
			pllVideo |= 1UL << 19;
			break;

		case 4:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_set) = (3UL << 30);
			pllVideo |= 1UL << 20;
			break;

		case 2:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_clr) = (3UL << 30);
			pllVideo |= 1UL << 19;
			break;

		default:
			*(imxrt_common.ccm_analog + ccm_analog_misc2_clr) = (3UL << 30);
			pllVideo |= 1UL << 20;
			break;
	}

	*(imxrt_common.ccm_analog + ccm_analog_pll_video) = pllVideo;

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_video) & (1UL << 31)) == 0U) {
	}
}


void _imxrt_ccmDeinitVideoPll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_video) = 1UL << 12;
}


void _imxrt_ccmInitEnetPll(u8 enclk0, u8 enclk1, u8 enclk2, u8 div0, u8 div1)
{
	u32 enet_pll = (((u32)div1 & 0x3U) << 2) | ((u32)div0 & 0x3U);

	if (enclk0 != 0U) {
		enet_pll |= 1UL << 13;
	}

	if (enclk1 != 0U) {
		enet_pll |= 1UL << 20;
	}

	if (enclk2 != 0U) {
		enet_pll |= 1UL << 21;
	}

	/* enable bypass during clock frequency change */
	*(imxrt_common.ccm_analog + ccm_analog_pll_enet) = 1UL << 16;

	*(imxrt_common.ccm_analog + ccm_analog_pll_enet) |= enet_pll;

	while ((*(imxrt_common.ccm_analog + ccm_analog_pll_enet) & (1UL << 31)) == 0U) {
	}

	*(imxrt_common.ccm_analog + ccm_analog_pll_enet) &= ~(1UL << 16);
}


void _imxrt_ccmDeinitEnetPll(void)
{
	*(imxrt_common.ccm_analog + ccm_analog_pll_enet) = 1UL << 12;
}


u32 _imxrt_ccmGetPllFreq(int pll)
{
	u32 freq, divSel, num, denom;
	u64 tmp;

	switch (pll) {
		case clk_pll_arm:
			freq = ((_imxrt_ccmGetOscFreq() * (*(imxrt_common.ccm_analog + ccm_analog_pll_arm) & 0x7fU)) >> 1);
			break;

		case clk_pll_sys:
			freq = _imxrt_ccmGetOscFreq();

			/* PLL output frequency = Fref * (DIV_SELECT + NUM/DENOM). */
			num = *(imxrt_common.ccm_analog + ccm_analog_pll_sys_num);
			denom = *(imxrt_common.ccm_analog + ccm_analog_pll_sys_denom);
			tmp = ((u64)freq * (u64)num) / (u64)denom;

			if ((*(imxrt_common.ccm_analog + ccm_analog_pll_sys) & 1U) != 0U) {
				freq *= 22U;
			}
			else {
				freq *= 20U;
			}

			freq += (u32)tmp;
			break;

		case clk_pll_usb1:
			freq = _imxrt_ccmGetOscFreq() * ((*(imxrt_common.ccm_analog + ccm_analog_pll_usb1) & 0x3U) == 0U ? 22U : 20U);
			break;

		case clk_pll_audio:
			freq = _imxrt_ccmGetOscFreq();

			divSel = *(imxrt_common.ccm_analog + ccm_analog_pll_audio) & 0x7fU;
			num = *(imxrt_common.ccm_analog + ccm_analog_pll_audio_num);
			denom = *(imxrt_common.ccm_analog + ccm_analog_pll_audio_denom);
			tmp = ((u64)freq * (u64)num) / (u64)denom;
			freq = freq * divSel + (u32)tmp;

			switch ((*(imxrt_common.ccm_analog + ccm_analog_pll_audio) >> 19) & 0x3U) {
				case 0:
					freq >>= 2;
					break;

				case 1:
					freq >>= 1;
					break;

				default:
					/* No action required */
					break;
			}

			if ((*(imxrt_common.ccm_analog + ccm_analog_misc2) & (1UL << 15)) != 0U) {
				if ((*(imxrt_common.ccm_analog + ccm_analog_misc2) & (1UL << 31)) != 0U) {
					freq >>= 2;
				}
				else {
					freq >>= 1;
				}
			}
			break;

		case clk_pll_video:
			freq = _imxrt_ccmGetOscFreq();

			divSel = *(imxrt_common.ccm_analog + ccm_analog_pll_video) & 0x7fU;
			num = *(imxrt_common.ccm_analog + ccm_analog_pll_video_num);
			denom = *(imxrt_common.ccm_analog + ccm_analog_pll_video_denom);
			tmp = ((u64)freq * (u64)num) / (u64)denom;

			freq = freq * divSel + (u32)tmp;

			switch ((*(imxrt_common.ccm_analog + ccm_analog_pll_video) >> 19) & 0x3U) {
				case 0:
					freq >>= 2;
					break;

				case 1:
					freq >>= 1;
					break;

				default:
					/* No action required */
					break;
			}

			if ((*(imxrt_common.ccm_analog + ccm_analog_misc2) & (1UL << 30)) != 0U) {
				if ((*(imxrt_common.ccm_analog + ccm_analog_misc2) & (1UL << 31)) != 0U) {
					freq >>= 2;
				}
				else {
					freq >>= 1;
				}
			}
			break;

		case clk_pll_enet0:
			divSel = *(imxrt_common.ccm_analog + ccm_analog_pll_enet) & 0x3U;

			switch (divSel) {
				case 0:
					freq = 25000000;
					break;

				case 1:
					freq = 50000000;
					break;

				case 2:
					freq = 100000000;
					break;

				default:
					freq = 125000000;
					break;
			}
			break;

		case clk_pll_enet1:
			divSel = (*(imxrt_common.ccm_analog + ccm_analog_pll_enet) >> 2) & (0x3U);

			switch (divSel) {
				case 0:
					freq = 25000000;
					break;

				case 1:
					freq = 50000000;
					break;

				case 2:
					freq = 100000000;
					break;

				default:
					freq = 125000000;
					break;
			}
			break;

		case clk_pll_enet2:
			/* ref_enetpll2 if fixed at 25MHz. */
			freq = 25000000;
			break;

		case clk_pll_usb2:
			freq = _imxrt_ccmGetOscFreq() * ((*(imxrt_common.ccm_analog + ccm_analog_pll_usb2) & 0x3U) == 0U ? 22UL : 20UL);
			break;

		default:
			freq = 0;
			break;
	}

	return freq;
}


void _imxrt_ccmInitSysPfd(int pfd, u8 pfdFrac)
{
	u32 pfd528 = *(imxrt_common.ccm_analog + ccm_analog_pfd_528) & ~(0xbfU << ((unsigned int)pfd << 3));

	*(imxrt_common.ccm_analog + ccm_analog_pfd_528) = pfd528 | ((1UL << 7U) << ((unsigned int)pfd << 3));
	*(imxrt_common.ccm_analog + ccm_analog_pfd_528) = pfd528 | (((u32)pfdFrac & 0x3fU) << ((unsigned int)pfd << 3));
}


void _imxrt_ccmDeinitSysPfd(int pfd)
{
	*(imxrt_common.ccm_analog + ccm_analog_pfd_528) |= (1UL << 7U) << ((unsigned int)pfd << 3);
}


