phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
void _imxrt_ccmInitUsb1Pfd(int pfd, u8 pfdFrac)
{
	u32 pfd480 = *(imxrt_common.ccm_analog + ccm_analog_pfd_480) & ~(0xbfU << ((unsigned int)pfd << 3));

	*(imxrt_common.ccm_analog + ccm_analog_pfd_480) = pfd480 | ((1UL << 7) << ((unsigned int)pfd << 3));
	*(imxrt_common.ccm_analog + ccm_analog_pfd_480) = pfd480 | (((u32)pfdFrac & 0x3fU) << ((unsigned int)pfd << 3));
}


void _imxrt_ccmDeinitUsb1Pfd(int pfd)
{
	*(imxrt_common.ccm_analog + ccm_analog_pfd_480) |= (1UL << 7) << ((unsigned int)pfd << 3);
}


u32 _imxrt_ccmGetSysPfdFreq(int pfd)
{
	u32 freq = _imxrt_ccmGetPllFreq(clk_pll_sys);

	switch (pfd) {
		case clk_pfd0:
			freq /= *(imxrt_common.ccm_analog + ccm_analog_pfd_528) & 0x3fU;
			break;

		case clk_pfd1:
			freq /= (*(imxrt_common.ccm_analog + ccm_analog_pfd_528) >> 8) & 0x3fU;
			break;

		case clk_pfd2:
			freq /= (*(imxrt_common.ccm_analog + ccm_analog_pfd_528) >> 16) & 0x3fU;
			break;

		case clk_pfd3:
			freq /= (*(imxrt_common.ccm_analog + ccm_analog_pfd_528) >> 24) & 0x3fU;
			break;

		default:
			freq = 0;
			break;
	}

	return freq * 18U;
}


u32 _imxrt_ccmGetUsb1PfdFreq(int pfd)
{
	u32 freq = _imxrt_ccmGetPllFreq(clk_pll_usb1);

	switch (pfd) {
		case clk_pfd0:
			freq /= *(imxrt_common.ccm_analog + ccm_analog_pfd_480) & 0x3fU;
			break;

		case clk_pfd1:
			freq /= (*(imxrt_common.ccm_analog + ccm_analog_pfd_480) >> 8) & 0x3fU;
			break;

		case clk_pfd2:
			freq /= (*(imxrt_common.ccm_analog + ccm_analog_pfd_480) >> 16) & 0x3fU;
			break;

		case clk_pfd3:
			freq /= (*(imxrt_common.ccm_analog + ccm_analog_pfd_480) >> 24) & 0x3fU;
			break;

		default:
			freq = 0U;
			break;
	}

	return freq * 18U;
}


void _imxrt_ccmSetMux(int mux, u32 val)
{
	switch (mux) {
		case clk_mux_pll3:
			*(imxrt_common.ccm + ccm_ccsr) = (*(imxrt_common.ccm + ccm_ccsr) & ~1U) | (val & 1U);
			break;

		case clk_mux_periph:
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(1UL << 25)) | ((val & 1U) << 25);
			while ((*(imxrt_common.ccm + ccm_cdhipr) & (1U << 5)) != 0U) {
			}
			break;

		case clk_mux_semcAlt:
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(1U << 7)) | ((val & 1U) << 7);
			break;

		case clk_mux_semc:
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(1U << 6)) | ((val & 1U) << 6);
			break;

		case clk_mux_prePeriph:
			*(imxrt_common.ccm + ccm_cbcmr) = (*(imxrt_common.ccm + ccm_cbcmr) & ~(0x3UL << 18)) | ((val & 0x3U) << 18);
			break;

		case clk_mux_trace:
			*(imxrt_common.ccm + ccm_cbcmr) = (*(imxrt_common.ccm + ccm_cbcmr) & ~(0x3UL << 14)) | ((val & 0x3U) << 14);
			break;

		case clk_mux_periphclk2:
			*(imxrt_common.ccm + ccm_cbcmr) = (*(imxrt_common.ccm + ccm_cbcmr) & ~(0x3UL << 12)) | ((val & 0x3U) << 12);
			break;

		case clk_mux_lpspi:
			*(imxrt_common.ccm + ccm_cbcmr) = (*(imxrt_common.ccm + ccm_cbcmr) & ~(0x3U << 4)) | ((val & 0x3U) << 4);
			break;

		case clk_mux_flexspi:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(0x3UL << 29)) | ((val & 0x3U) << 29);
			break;

		case clk_mux_usdhc2:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(1UL << 17)) | ((val & 1U) << 17);
			break;

		case clk_mux_usdhc1:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(1UL << 16)) | ((val & 1U) << 16);
			break;

		case clk_mux_sai3:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(0x3UL << 14)) | ((val & 0x3U) << 14);
			break;

		case clk_mux_sai2:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(0x3UL << 12)) | ((val & 0x3U) << 12);
			break;

		case clk_mux_sai1:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(0x3UL << 10)) | ((val & 0x3U) << 10);
			break;

		case clk_mux_perclk:
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(1UL << 6)) | ((val & 1U) << 6);
			break;

		case clk_mux_flexio2:
			*(imxrt_common.ccm + ccm_cscmr2) = (*(imxrt_common.ccm + ccm_cscmr2) & ~(0x3UL << 19)) | ((val & 0x3U) << 19);
			break;

		case clk_mux_can:
			*(imxrt_common.ccm + ccm_cscmr2) = (*(imxrt_common.ccm + ccm_cscmr2) & ~(0x3UL << 8)) | ((val & 0x3U) << 8);
			break;

		case clk_mux_uart:
			*(imxrt_common.ccm + ccm_cscdr1) = (*(imxrt_common.ccm + ccm_cscdr1) & ~(1U << 6)) | ((val & 1U) << 6);
			break;

		case clk_mux_enc:
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~(0x7UL << 15)) | ((val & 0x7U) << 15);
			break;

		case clk_mux_ldbDi1:
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~(0x7UL << 12)) | ((val & 0x7U) << 12);
			break;

		case clk_mux_ldbDi0:
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~(0x7UL << 9)) | ((val & 0x7U) << 9);
			break;

		case clk_mux_spdif:
			*(imxrt_common.ccm + ccm_cdcdr) = (*(imxrt_common.ccm + ccm_cdcdr) & ~(0x3UL << 20)) | ((val & 0x3U) << 20);
			break;

		case clk_mux_flexio1:
			*(imxrt_common.ccm + ccm_cdcdr) = (*(imxrt_common.ccm + ccm_cdcdr) & ~(0x3UL << 7)) | ((val & 0x3U) << 7);
			break;

		case clk_mux_lpi2c:
			*(imxrt_common.ccm + ccm_cscdr2) = (*(imxrt_common.ccm + ccm_cscdr2) & ~(1UL << 18)) | ((val & 1U) << 18);
			break;

		case clk_mux_lcdif1pre:
			*(imxrt_common.ccm + ccm_cscdr2) = (*(imxrt_common.ccm + ccm_cscdr2) & ~(0x7UL << 15)) | ((val & 0x7U) << 15);
			break;

		case clk_mux_lcdif1:
			*(imxrt_common.ccm + ccm_cscdr2) = (*(imxrt_common.ccm + ccm_cscdr2) & ~(0x7UL << 9)) | ((val & 0x7U) << 9);
			break;

		case clk_mux_csi:
			*(imxrt_common.ccm + ccm_cscdr3) = (*(imxrt_common.ccm + ccm_cscdr3) & ~(0x3UL << 9)) | ((val & 0x3U) << 9);
			break;

		default:
			/* No action required */
			break;
	}
}


u32 _imxrt_ccmGetMux(int mux)
{
	u32 val = 0;

	switch (mux) {
		case clk_mux_pll3:
			val = *(imxrt_common.ccm + ccm_ccsr) & 1U;
			break;

		case clk_mux_periph:
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 25) & 1U;
			break;

		case clk_mux_semcAlt:
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 7) & 1U;
			break;

		case clk_mux_semc:
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 6) & 1U;
			break;

		case clk_mux_prePeriph:
			val = (*(imxrt_common.ccm + ccm_cbcmr) >> 18) & 0x3U;
			break;

		case clk_mux_trace:
			val = (*(imxrt_common.ccm + ccm_cbcmr) >> 14) & 0x3U;
			break;

		case clk_mux_periphclk2:
			val = (*(imxrt_common.ccm + ccm_cbcmr) >> 12) & 0x3U;
			break;

		case clk_mux_lpspi:
			val = (*(imxrt_common.ccm + ccm_cbcmr) >> 4) & 0x3U;
			break;

		case clk_mux_flexspi:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 29) & 0x3U;
			break;

		case clk_mux_usdhc2:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 17) & 1U;
			break;

		case clk_mux_usdhc1:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 16) & 1U;
			break;

