phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
		case clk_mux_sai3:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 14) & 0x3U;
			break;

		case clk_mux_sai2:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 12) & 0x3U;
			break;

		case clk_mux_sai1:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 10) & 0x3U;
			break;

		case clk_mux_perclk:
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 6) & 1U;
			break;

		case clk_mux_flexio2:
			val = (*(imxrt_common.ccm + ccm_cscmr2) >> 19) & 0x3U;
			break;

		case clk_mux_can:
			val = (*(imxrt_common.ccm + ccm_cscmr2) >> 8) & 0x3U;
			break;

		case clk_mux_uart:
			val = (*(imxrt_common.ccm + ccm_cscdr1) >> 6) & 1U;
			break;

		case clk_mux_enc:
			val = (*(imxrt_common.ccm + ccm_cs2cdr) >> 15) & 0x7U;
			break;

		case clk_mux_ldbDi1:
			val = (*(imxrt_common.ccm + ccm_cs2cdr) >> 12) & 0x7U;
			break;

		case clk_mux_ldbDi0:
			val = (*(imxrt_common.ccm + ccm_cs2cdr) >> 9) & 0x7U;
			break;

		case clk_mux_spdif:
			val = (*(imxrt_common.ccm + ccm_cdcdr) >> 20) & 0x3U;
			break;

		case clk_mux_flexio1:
			val = (*(imxrt_common.ccm + ccm_cdcdr) >> 7) & 0x3U;
			break;

		case clk_mux_lpi2c:
			val = (*(imxrt_common.ccm + ccm_cscdr2) >> 18) & 1U;
			break;

		case clk_mux_lcdif1pre:
			val = (*(imxrt_common.ccm + ccm_cscdr2) >> 15) & 0x7U;
			break;

		case clk_mux_lcdif1:
			val = (*(imxrt_common.ccm + ccm_cscdr2) >> 9) & 0x7U;
			break;

		case clk_mux_csi:
			val = (*(imxrt_common.ccm + ccm_cscdr3) >> 9) & 0x3U;
			break;

		default:
			/* No action required */
			break;
	}

	return val;
}


void _imxrt_ccmSetDiv(int div, u32 val)
{
	switch (div) {
		case clk_div_arm: /* CACRR */
			*(imxrt_common.ccm + ccm_cacrr) = (*(imxrt_common.ccm + ccm_cacrr) & ~0x7U) | (val & 0x7U);
			while ((*(imxrt_common.ccm + ccm_cdhipr) & (1UL << 16)) != 0U) {
			}
			break;

		case clk_div_periphclk2: /* CBCDR */
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(0x7UL << 27)) | ((val & 0x7U) << 27);
			break;

		case clk_div_semc: /* CBCDR */
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(0x7UL << 16)) | ((val & 0x7U) << 16);
			while ((*(imxrt_common.ccm + ccm_cdhipr) & 1U) != 0U) {
			}
			break;

		case clk_div_ahb: /* CBCDR */
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(0x7UL << 10)) | ((val & 0x7U) << 10);
			while ((*(imxrt_common.ccm + ccm_cdhipr) & (1U << 1)) != 0U) {
			}
			break;

		case clk_div_ipg: /* CBCDR */
			*(imxrt_common.ccm + ccm_cbcdr) = (*(imxrt_common.ccm + ccm_cbcdr) & ~(0x3UL << 8)) | ((val & 0x3U) << 8);
			break;

		case clk_div_lpspi: /* CBCMR */
			*(imxrt_common.ccm + ccm_cbcmr) = (*(imxrt_common.ccm + ccm_cbcmr) & ~(0x7UL << 26)) | ((val & 0x7U) << 26);
			break;

		case clk_div_lcdif1: /* CBCMR */
			*(imxrt_common.ccm + ccm_cbcmr) = (*(imxrt_common.ccm + ccm_cbcmr) & ~(0x7UL << 23)) | ((val & 0x7U) << 23);
			break;

		case clk_div_flexspi: /* CSCMR1 */
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~(0x7UL << 23)) | ((val & 0x7U) << 23);
			break;

		case clk_div_perclk: /* CSCMR1 */
			*(imxrt_common.ccm + ccm_cscmr1) = (*(imxrt_common.ccm + ccm_cscmr1) & ~0x3fU) | (val & 0x3fU);
			break;

		case clk_div_ldbDi1: /* CSCMR2 */
			*(imxrt_common.ccm + ccm_cscmr2) = (*(imxrt_common.ccm + ccm_cscmr2) & ~(1UL << 11)) | ((val & 1U) << 11);
			break;

		case clk_div_ldbDi0: /* CSCMR2 */
			*(imxrt_common.ccm + ccm_cscmr2) = (*(imxrt_common.ccm + ccm_cscmr2) & ~(1UL << 10)) | ((val & 1U) << 10);
			break;

		case clk_div_can: /* CSCMR2 */
			*(imxrt_common.ccm + ccm_cscmr2) = (*(imxrt_common.ccm + ccm_cscmr2) & ~(0x3fU << 2)) | ((val & 0x3fU) << 2);
			break;

		case clk_div_trace: /* CSCDR1 */
			*(imxrt_common.ccm + ccm_cscdr1) = (*(imxrt_common.ccm + ccm_cscdr1) & ~(0x7UL << 25)) | ((val & 0x7U) << 25);
			break;

		case clk_div_usdhc2: /* CSCDR1 */
			*(imxrt_common.ccm + ccm_cscdr1) = (*(imxrt_common.ccm + ccm_cscdr1) & ~(0x7UL << 16)) | ((val & 0x7U) << 16);
			break;

		case clk_div_usdhc1: /* CSCDR1 */
			*(imxrt_common.ccm + ccm_cscdr1) = (*(imxrt_common.ccm + ccm_cscdr1) & ~(0x7UL << 11)) | ((val & 0x7U) << 11);
			break;

		case clk_div_uart: /* CSCDR1 */
			*(imxrt_common.ccm + ccm_cscdr1) = (*(imxrt_common.ccm + ccm_cscdr1) & ~0x3fU) | (val & 0x3fU);
			break;

		case clk_div_flexio2: /* CS1CDR */
			*(imxrt_common.ccm + ccm_cs1cdr) = (*(imxrt_common.ccm + ccm_cs1cdr) & ~(0x7UL << 25)) | ((val & 0x7U) << 25);
			break;

		case clk_div_sai3pre: /* CS1CDR */
			*(imxrt_common.ccm + ccm_cs1cdr) = (*(imxrt_common.ccm + ccm_cs1cdr) & ~(0x7UL << 22)) | ((val & 0x7U) << 22);
			break;

		case clk_div_sai3: /* CS1CDR */
			*(imxrt_common.ccm + ccm_cs1cdr) = (*(imxrt_common.ccm + ccm_cs1cdr) & ~(0x3fUL << 16)) | ((val & 0x3fU) << 16);
			break;

		case clk_div_flexio2pre: /* CS1CDR */
			*(imxrt_common.ccm + ccm_cs1cdr) = (*(imxrt_common.ccm + ccm_cs1cdr) & ~(0x7UL << 9)) | ((val & 0x7U) << 9);
			break;

		case clk_div_sai1pre: /* CS1CDR */
			*(imxrt_common.ccm + ccm_cs1cdr) = (*(imxrt_common.ccm + ccm_cs1cdr) & ~(0x7UL << 6)) | ((val & 0x7U) << 6);
			break;

		case clk_div_sai1: /* CS1CDR */
			*(imxrt_common.ccm + ccm_cs1cdr) = (*(imxrt_common.ccm + ccm_cs1cdr) & ~0x3fU) | (val & 0x3fU);
			break;

		case clk_div_enc: /* CS2CDR */
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~(0x3fUL << 21)) | ((val & 0x3fU) << 21);
			break;

		case clk_div_encpre: /* CS2CDR */
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~(0x7UL << 18)) | ((val & 0x7U) << 18);
			break;

		case clk_div_sai2pre: /* CS2CDR */
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~(0x7UL << 6)) | ((val & 0x7U) << 6);
			break;

		case clk_div_sai2: /* CS2CDR */
			*(imxrt_common.ccm + ccm_cs2cdr) = (*(imxrt_common.ccm + ccm_cs2cdr) & ~0x3fU) | (val & 0x3fU);
			break;

		case clk_div_spdif0pre: /* CDCDR */
			*(imxrt_common.ccm + ccm_cdcdr) = (*(imxrt_common.ccm + ccm_cdcdr) & ~(0x7UL << 25)) | ((val & 0x7U) << 25);
			break;

		case clk_div_spdif0: /* CDCDR */
			*(imxrt_common.ccm + ccm_cdcdr) = (*(imxrt_common.ccm + ccm_cdcdr) & ~(0x7UL << 22)) | ((val & 0x7U) << 22);
			break;

