phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
		case clk_div_flexio1pre: /* CDCDR */
			*(imxrt_common.ccm + ccm_cdcdr) = (*(imxrt_common.ccm + ccm_cdcdr) & ~(0x7UL << 12)) | ((val & 0x7U) << 12);
			break;

		case clk_div_flexio1: /* CDCDR */
			*(imxrt_common.ccm + ccm_cdcdr) = (*(imxrt_common.ccm + ccm_cdcdr) & ~(0x7UL << 9)) | ((val & 0x7U) << 9);
			break;

		case clk_div_lpi2c: /* CSCDR2 */
			*(imxrt_common.ccm + ccm_cscdr2) = (*(imxrt_common.ccm + ccm_cscdr2) & ~(0x3fUL << 19)) | ((val & 0x3fU) << 19);
			break;

		case clk_div_lcdif1pre: /* CSCDR2 */
			*(imxrt_common.ccm + ccm_cscdr2) = (*(imxrt_common.ccm + ccm_cscdr2) & ~(0x7UL << 12)) | ((val & 0x7U) << 12);
			break;

		case clk_div_csi: /* CSCDR3 */
			*(imxrt_common.ccm + ccm_cscdr3) = (*(imxrt_common.ccm + ccm_cscdr3) & ~(0x7UL << 11)) | ((val & 0x7U) << 11);
			break;

		default:
			/* No action required */
			break;
	}
}


u32 _imxrt_ccmGetDiv(int div)
{
	u32 val = 0;

	switch (div) {
		case clk_div_arm: /* CACRR */
			val = *(imxrt_common.ccm + ccm_cacrr) & 0x7U;
			break;

		case clk_div_periphclk2: /* CBCDR */
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 27) & 0x7U;
			break;

		case clk_div_semc: /* CBCDR */
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 16) & 0x7U;
			break;

		case clk_div_ahb: /* CBCDR */
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 10) & 0x7U;
			break;

		case clk_div_ipg: /* CBCDR */
			val = (*(imxrt_common.ccm + ccm_cbcdr) >> 8) & 0x3U;
			break;

		case clk_div_lpspi: /* CBCMR */
			val = (*(imxrt_common.ccm + ccm_cbcmr) >> 26) & 0x7U;
			break;

		case clk_div_lcdif1: /* CBCMR */
			val = (*(imxrt_common.ccm + ccm_cbcmr) >> 23) & 0x7U;
			break;

		case clk_div_flexspi: /* CSCMR1 */
			val = (*(imxrt_common.ccm + ccm_cscmr1) >> 23) & 0x7U;
			break;

		case clk_div_perclk: /* CSCMR1 */
			val = *(imxrt_common.ccm + ccm_cscmr1) & 0x3fU;
			break;

		case clk_div_ldbDi1: /* CSCMR2 */
			val = (*(imxrt_common.ccm + ccm_cscmr2) >> 11) & 1U;
			break;

		case clk_div_ldbDi0: /* CSCMR2 */
			val = (*(imxrt_common.ccm + ccm_cscmr2) >> 10) & 1U;
			break;

		case clk_div_can: /* CSCMR2 */
			val = (*(imxrt_common.ccm + ccm_cscmr2) >> 2) & 0x3fU;
			break;

		case clk_div_trace: /* CSCDR1 */
			val = (*(imxrt_common.ccm + ccm_cscdr1) >> 25) & 0x7U;
			break;

		case clk_div_usdhc2: /* CSCDR1 */
			val = (*(imxrt_common.ccm + ccm_cscdr1) >> 16) & 0x7U;
			break;

		case clk_div_usdhc1: /* CSCDR1 */
			val = (*(imxrt_common.ccm + ccm_cscdr1) >> 11) & 0x7U;
			break;

		case clk_div_uart: /* CSCDR1 */
			val = *(imxrt_common.ccm + ccm_cscdr1) & 0x3fU;
			break;

		case clk_div_flexio2: /* CS1CDR */
			val = (*(imxrt_common.ccm + ccm_cs1cdr) >> 25) & 0x7U;
			break;

		case clk_div_sai3pre: /* CS1CDR */
			val = (*(imxrt_common.ccm + ccm_cs1cdr) >> 22) & 0x7U;
			break;

		case clk_div_sai3: /* CS1CDR */
			val = (*(imxrt_common.ccm + ccm_cs1cdr) >> 16) & 0x3fU;
			break;

		case clk_div_flexio2pre: /* CS1CDR */
			val = (*(imxrt_common.ccm + ccm_cs1cdr) >> 9) & 0x7U;
			break;

		case clk_div_sai1pre: /* CS1CDR */
			val = (*(imxrt_common.ccm + ccm_cs1cdr) >> 6) & 0x7U;
			break;

		case clk_div_sai1: /* CS1CDR */
			val = *(imxrt_common.ccm + ccm_cs1cdr) & 0x3fU;
			break;

		case clk_div_enc: /* CS2CDR */
			val = (*(imxrt_common.ccm + ccm_cs2cdr) >> 21) & 0x3fU;
			break;

		case clk_div_encpre: /* CS2CDR */
			val = (*(imxrt_common.ccm + ccm_cs2cdr) >> 18) & 0x7U;
			break;

		case clk_div_sai2pre: /* CS2CDR */
			val = (*(imxrt_common.ccm + ccm_cs2cdr) >> 6) & 0x7U;
			break;

		case clk_div_sai2: /* CS2CDR */
			val = *(imxrt_common.ccm + ccm_cs2cdr) & 0x3fU;
			break;

		case clk_div_spdif0pre: /* CDCDR */
			val = (*(imxrt_common.ccm + ccm_cdcdr) >> 25) & 0x7U;
			break;

		case clk_div_spdif0: /* CDCDR */
			val = (*(imxrt_common.ccm + ccm_cdcdr) >> 22) & 0x7U;
			break;

		case clk_div_flexio1pre: /* CDCDR */
			val = (*(imxrt_common.ccm + ccm_cdcdr) >> 12) & 0x7U;
			break;

		case clk_div_flexio1: /* CDCDR */
			val = (*(imxrt_common.ccm + ccm_cdcdr) >> 9) & 0x7U;
			break;

		case clk_div_lpi2c: /* CSCDR2 */
			val = (*(imxrt_common.ccm + ccm_cscdr2) >> 19) & 0x3fU;
			break;

		case clk_div_lcdif1pre: /* CSCDR2 */
			val = (*(imxrt_common.ccm + ccm_cscdr2) >> 12) & 0x7U;
			break;

		case clk_div_csi: /* CSCDR3 */
			val = (*(imxrt_common.ccm + ccm_cscdr3) >> 11) & 0x7U;
			break;

		default:
			/* No action required */
			break;
	}

	return val;
}


void _imxrt_ccmControlGate(int dev, int state)
{
	unsigned int index = ((unsigned int)dev >> 4);
	unsigned int shift = ((unsigned int)dev & 0xfU) << 1;
	u32 t;

	if (index > 7U) {
		return;
	}

	t = *(imxrt_common.ccm + ccm_ccgr0 + index) & ~(0x3UL << shift);
	*(imxrt_common.ccm + ccm_ccgr0 + index) = t | (((unsigned int)state & 0x3U) << shift);

	hal_cpuDataSyncBarrier();
	hal_cpuInstrBarrier();
}


void _imxrt_ccmSetMode(int mode)
{
	*(imxrt_common.ccm + ccm_clpcr) = (*(imxrt_common.ccm + ccm_clpcr) & ~0x3U) | ((unsigned int)mode & 0x3U);
}


/* GPIO */


static volatile u32 *_imxrt_gpioGetReg(unsigned int d)
{
	switch (d) {
		case gpio1:
			return imxrt_common.gpio[0];
		case gpio2:
			return imxrt_common.gpio[1];
		case gpio3:
			return imxrt_common.gpio[2];
		case gpio4:
			return imxrt_common.gpio[3];
		case gpio5:
			return imxrt_common.gpio[4];
		default:
			/* No action required */
			break;
	}

	return NULL;
}


int _imxrt_gpioConfig(unsigned int d, u8 pin, u8 dir)
{
	volatile u32 *reg = _imxrt_gpioGetReg(d);

	_imxrt_ccmControlGate((int)d, 1);

	if ((reg == NULL) || (pin > 31U)) {
		return -EINVAL;
	}

	*(reg + gpio_gdir) &= ~((dir == 0U ? 1UL : 0UL) << pin);
	*(reg + gpio_gdir) |= (dir == 0U ? 0UL : 1UL) << pin;

	return EOK;
}


int _imxrt_gpioSet(unsigned int d, u8 pin, u8 val)
{
	volatile u32 *reg = _imxrt_gpioGetReg(d);

	if ((reg == NULL) || (pin > 31U)) {
		return -EINVAL;
	}

	*(reg + gpio_dr) &= ~((val == 0U ? 1UL : 0UL) << pin);
	*(reg + gpio_dr) |= (val == 0U ? 0UL : 1UL) << pin;

	return EOK;
}


int _imxrt_gpioSetPort(unsigned int d, u32 val)
{
	volatile u32 *reg = _imxrt_gpioGetReg(d);

