phoenix-rtos/phoenix-rtos-kernel/hal/armv7m/imxrt/10xx/imxrt10xx.c
	if (reg == NULL) {
		return -EINVAL;
	}

	*(reg + gpio_dr) = val;

	return EOK;
}


int _imxrt_gpioGet(unsigned int d, u8 pin, u8 *val)
{
	volatile u32 *reg = _imxrt_gpioGetReg(d);

	if ((reg == NULL) || (pin > 31U)) {
		return -EINVAL;
	}

	*val = ((*(reg + gpio_psr) & (1UL << pin)) == 0U) ? 1U : 0U;

	return EOK;
}


int _imxrt_gpioGetPort(unsigned int d, u32 *val)
{
	volatile u32 *reg = _imxrt_gpioGetReg(d);

	if (reg == NULL) {
		return -EINVAL;
	}

	*val = *(reg + gpio_psr);

	return EOK;
}


void _imxrt_wdgReload(void)
{
#if defined(WATCHDOG)
	hal_cpuDisableInterrupts();
	*(imxrt_common.rtwdog + rtwdog_cnt) = RTWDOG_REFRESH_KEY;
	hal_cpuEnableInterrupts();
#endif
}


void _imxrt_platformInit(void)
{
	hal_spinlockCreate(&imxrt_common.pltctlSp, "pltctlSp");
}


void _imxrt_init(void)
{
	unsigned int i;

	imxrt_common.gpio[0] = (void *)0x401b8000U;
	imxrt_common.gpio[1] = (void *)0x401bc000U;
	imxrt_common.gpio[2] = (void *)0x401c0000U;
	imxrt_common.gpio[3] = (void *)0x401c4000U;
	imxrt_common.gpio[4] = (void *)0x400c0000U;
	imxrt_common.aips[0] = (void *)0x4007c000U;
	imxrt_common.aips[1] = (void *)0x4017c000U;
	imxrt_common.aips[2] = (void *)0x4027c000U;
	imxrt_common.aips[3] = (void *)0x4037c000U;
	imxrt_common.ccm = (void *)0x400fc000U;
	imxrt_common.ccm_analog = (void *)0x400d8000U;
	imxrt_common.pmu = (void *)0x400d8110U;
	imxrt_common.xtalosc = (void *)0x400d8000U;
	imxrt_common.iomuxgpr = (void *)0x400ac000U;
	imxrt_common.iomuxc = (void *)0x401f8000U;
	imxrt_common.iomuxsnvs = (void *)0x400a8000U;
	imxrt_common.stk = (void *)0xe000e010U;
	imxrt_common.wdog1 = (void *)0x400b8000U;
	imxrt_common.wdog2 = (void *)0x400d0000U;
	imxrt_common.rtwdog = (void *)0x400bc000U;
	imxrt_common.src = (void *)0x400f8000U;

	imxrt_common.xtaloscFreq = 24000000U;
	imxrt_common.cpuclk = 528000000U; /* Default system clock */

	_hal_scsInit();
	(void)_hal_rttInit();

	/* Disable watchdogs */
	if ((*(imxrt_common.wdog1 + wdog_wcr) & (1U << 2)) != 0U) {
		*(imxrt_common.wdog1 + wdog_wcr) &= ~(1U << 2);
	}
	if ((*(imxrt_common.wdog2 + wdog_wcr) & (1U << 2)) != 0U) {
		*(imxrt_common.wdog2 + wdog_wcr) &= ~(1U << 2);
	}

	(void)_imxrt_setDevClock(pctl_clk_wdog3, clk_state_run);

	/* RTWDOG unlock update */
	*(imxrt_common.rtwdog + rtwdog_cnt) = RTWDOG_UPDATE_KEY;
	while ((*(imxrt_common.rtwdog + rtwdog_cs) & (1UL << 11)) == 0U) {
	}
#if defined(WATCHDOG)
	/* Enable rtwdog: LPO_CLK (256 prescaler), set timeout to WATCHDOG_TIMEOUT_MS ms */
	*(imxrt_common.rtwdog + rtwdog_toval) =
			WATCHDOG_TIMEOUT_MS / (256 / (LPO_CLK_FREQ_HZ / 1000));
	*(imxrt_common.rtwdog + rtwdog_cs) =
			(*(imxrt_common.rtwdog + rtwdog_cs) | (1U << 7)) |
			(1UL << 13) | (1UL << 12) | (1UL << 8) | (1UL << 5);
	/* Refresh watchdog */
	*(imxrt_common.rtwdog + rtwdog_cnt) = RTWDOG_REFRESH_KEY;
#else
	/* Disable rtwdog, enable update */
	*(imxrt_common.rtwdog + rtwdog_toval) = 0xffffU;
	*(imxrt_common.rtwdog + rtwdog_cs) =
			(*(imxrt_common.rtwdog + rtwdog_cs) & ~(1UL << 7)) | (1UL << 5);
#endif
	/* Check update */
	while ((*(imxrt_common.rtwdog + rtwdog_cs) & (1UL << 10)) == 0U) {
	}

	/* Disable Systick which might be enabled by bootrom */
	if ((*(imxrt_common.stk + stk_ctrl) & 1U) != 0U) {
		*(imxrt_common.stk + stk_ctrl) &= ~1U;
	}

	/* Configure cache */
	_hal_scsDCacheEnable();
	_hal_scsICacheEnable();

	_imxrt_ccmControlGate(pctl_clk_iomuxc, clk_state_run_wait);

	_imxrt_ccmSetMux(clk_mux_periphclk2, 0x1);
	_imxrt_ccmSetMux(clk_mux_periph, 0x1);

	/* Configure ARM PLL to 1056M */
	_imxrt_ccmInitArmPll(88);
	_imxrt_ccmInitSysPll(1);
	_imxrt_ccmInitUsb1Pll(0);
	_imxrt_ccmInitUsb2Pll(0);

	_imxrt_ccmSetDiv(clk_div_arm, 0x1);
	_imxrt_ccmSetDiv(clk_div_ahb, 0x0);
	_imxrt_ccmSetDiv(clk_div_ipg, 0x3);

	/* Now CPU runs again on ARM PLL at 528M (with divider 2) */
	_imxrt_ccmSetMux(clk_mux_prePeriph, 0x3);
	_imxrt_ccmSetMux(clk_mux_periph, 0x0);

	/* Disable unused clocks */
	*(imxrt_common.ccm + ccm_ccgr0) = 0x00c0ffffU;
	*(imxrt_common.ccm + ccm_ccgr1) = 0x300c0000U;
	*(imxrt_common.ccm + ccm_ccgr2) = 0xfffff03fU;
	*(imxrt_common.ccm + ccm_ccgr3) = 0xf00c3fcfU;
	*(imxrt_common.ccm + ccm_ccgr4) = 0x0000ff3cU;
	*(imxrt_common.ccm + ccm_ccgr5) = 0xf00f333fU;
	*(imxrt_common.ccm + ccm_ccgr6) = 0x00fc0f0fU;

	hal_cpuDataSyncBarrier();
	hal_cpuInstrBarrier();

	/* Remain in run mode on wfi */
	_imxrt_ccmSetMode(0);

	/* Power down all unused PLL */
	_imxrt_ccmDeinitAudioPll();

	/* Wait for any pending CCM div/mux handshake process to complete */
	while ((*(imxrt_common.ccm + ccm_cdhipr) & 0x1002bU) != 0U) {
	}

	/* Allow userspace applications to access hardware registers */
	for (i = 0U; i < sizeof(imxrt_common.aips) / sizeof(imxrt_common.aips[0]); ++i) {
		*(imxrt_common.aips[i] + aipstz_opacr) &= ~0x44444444U;
		*(imxrt_common.aips[i] + aipstz_opacr1) &= ~0x44444444U;
		*(imxrt_common.aips[i] + aipstz_opacr2) &= ~0x44444444U;
		*(imxrt_common.aips[i] + aipstz_opacr3) &= ~0x44444444U;
		*(imxrt_common.aips[i] + aipstz_opacr4) &= ~0x44444444U;
	}

	/* Enable system HP timer clock gate */
	_imxrt_ccmControlGate(GPT_BUS_CLK, clk_state_run_wait);

	/* Enable FPU */
	_hal_scsFPUSet(1);
}
